.config/emacs/modules/custom-completion.el
(use-package vertico
  :ensure t
  :bind (:map vertico-map
              ("C-j" . vertico-next)
              ("C-k" . vertico-previous)
              ("M-h" . vertico-directory-up))
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))
(use-package vertico-posframe
  :disabled
  :after vertico
  :ensure t
  :init
  (setq vertico-posframe-parameters
        `((left-fringe . 8)
          (right-fringe . 8) (alpha . 100)))
  (vertico-posframe-mode 1))

(use-package marginalia
  :after vertico
  :ensure t
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))

;;(defun my/get-project-root ()   ;; TODO after projectile
;;  (when (fboundp 'projectile-project-root)
;;    (projectile-project-root)))
(use-package consult
  :demand t
  :bind (("C-s" . consult-line)
         :map minibuffer-local-map
         ("C-r" . consult-history))
  :custom
  ;;(consult-project-root-function #'get-project-root)
  (completion-in-region-function #'consult-completion-in-region))

(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (style basic partial-completion)))))
