.config/emacs/modules/custom-ui.el

(use-package page-break-lines)
(use-package dashboard
  :init      ;; tweak dashboard config before loading it
  (setq dashboard-projects-backend "project-el"
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-center-content t ;; set to 't' for centered content
        dashboard-items '((recents . 10)
                          (bookmarks . 5))
        ;;(projects . 10)))
        dashboard-set-footer t
        dashboard-page-separator "\n\f\n"
        dashboard-startup-banner 'logo ;; use standard emacs logo as banner
        dashboard-set-navigator t)

  ;;(setq dashboard-startup-banner "~/.config/doom/doom-emacs-dash.png")  ;; use custom image as banner
  ;; Format: "(icon title help action face prefix suffix)"
  (setq dashboard-navigator-buttons
        `(;; line1
          ((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
            "Github"
            "Browse my Github"
            (lambda (&rest _) (browse-url "https://github.com/JaeUs3792/")))
           (,(all-the-icons-octicon "home" :height 1.1 :v-adjust 0.0)
            "Homepage"
            "Browse my Homepage"
            (lambda (&rest _) (browse-url "https://jaeus.net"))))))
  :config
  (dashboard-setup-startup-hook)
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book"))))
(setq doom-fallback-buffer-name "*dashboard*")

(defun self-screenshot (&optional type)
  "Save a screenshot of type TYPE of the current Emacs frame.
As shown by the function `', type can weild the value `svg',
`png', `pdf'.

This function will output in /tmp a file beginning with \"Emacs\"
and ending with the extension of the requested TYPE."
  (interactive)
  (let* ((type (if type type
                 (intern (completing-read "Screenshot Type: "
                                          '(png svg pdf postscript)))))
         (extension (pcase type
                      ('png        ".png")
                      ('svg        ".svg")
                      ('pdf        ".pdf")
                      ('postscript ".ps")
                      (otherwise (error "Cannot export screenshot of type %s" otherwise))))
         (filename (make-temp-file "Emacs-" nil extension))
         (data     (x-export-frames nil type)))
    (with-temp-file filename
      (insert data))
    (kill-new filename)
    (rename-file filename (expand-file-name (file-name-nondirectory filename) "~"))
    (message filename)))

(provide 'custom-ui)
;;; custom-ui.el ends here
